Repository: Centaur/lua-nginx-module
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Internal redirection will destroy the original request <code>ngx.ctx</code> data (if any) and the new request will have an empty <code>ngx.ctx</code> table.
zh_cn: 内部重定向将删除原始请求的 request <code>ngx.ctx</code> 数据(如果有的话)，新的请求的 <code>ngx.ctx</code> 是空table.

source: Issue a synchronous but still non-blocking ''Nginx Subrequest'' using <code>uri</code>.
zh_cn: 对<code>uri</code>发起一个同步的但仍是非阻塞的 ''Nginx子请求''。

source: Issue an <code>HTTP 301</code> or <code>302</code> redirection to <code>uri</code>.
zh_cn: 发起到<code>uri</code>的 <code>HTTP 301</code> 或 <code>302</code> 重定向.

source: Issuing a POST subrequest, for example, can be done as follows
zh_cn: 例如，可以这样发起一个POST子请求

source: It also allows the registration of custom meta methods.
zh_cn: 而且还允许注册自定义的元方法。

source: It can also be retrieved later with the value.
zh_cn: 也可以在以后与值一起获取到.

source: It can be the current request's [[#ngx.ctx|ngx.ctx]] table, which effectively makes the parent and its subrequest to share exactly the same context table.
zh_cn: 这个值可以是当前请求的 [[#ngx.ctx|ngx.ctx]] table, 其结果是父请求和子请求共享同一个context able

source: It is <code>302</code> (<code>ngx.HTTP_MOVED_TEMPORARILY</code>) by default.
zh_cn: 默认值是 <code>302</code> (<code>ngx.HTTP_MOVED_TEMPORARILY</code>) .

source: It is actually implemented like this:
zh_cn: 它的实际实现象这样:

source: It is also possible to directly require the packages in external Lua modules:
zh_cn: 也可以直接在外部Lua模块里require这两个包:

source: It is also possible to use this <code>ctx</code> option to share the same [[#ngx.ctx|ngx.ctx]] table between the current (parent) request and the subrequest:
zh_cn: 也可以用 <code>ctx</code> 在当前（父）请求和子请求之间共享同一个 [[#ngx.ctx|ngx.ctx]] table:

source: It is equivalent to
zh_cn: 等价于

source: It is equivalent to <code>ngx.shared.DICT:set(key, nil)</code>.
zh_cn: 等价于 <code>ngx.shared.DICT:set(key, nil)</code>.

source: It is important here to call the [[#tcpsock:settimeout|settimeout]] method ''before'' calling the iterator function (note that the <code>receiveuntil</code> call is irrelevant here).
zh_cn: 重要的是如果要调用 [[#tcpsock:settimeout|settimeout]] ， 一定要在调用iterator函数''之前'' (注意这里 <code>receiveuntil</code> 的调用次序无所谓).

source: It is important here to call the [[#tcpsock:settimeout|settimeout]] method ''before'' calling this method.
zh_cn: 要调用 [[#tcpsock:settimeout|settimeout]] 必须在调用本方法 ''之前'' .

source: It is important here to call the [[#udpsock:settimeout|settimeout]] method ''before'' calling this method.
zh_cn: 要调用 [[#udpsock:settimeout|settimeout]] 必须在调用本方法 ''之前'' .

source: It is important to always call the [[#ngx.req.finish_body|ngx.req.finish_body]] after all the data has been appended onto the current request body.
zh_cn: 有一点很重要，在所有数据都已加到当前请求体中后，必须调用 [[#ngx.req.finish_body|ngx.req.finish_body]] 。

source: It is intended to be compatible with the TCP API of the [http://w3.impa.br/~diego/software/luasocket/tcp.html LuaSocket] library but is 100% nonblocking out of the box.
zh_cn: 它被设计为与 [http://w3.impa.br/~diego/software/luasocket/tcp.html LuaSocket]库的 TCP API兼容，但是它天生是100%非阻塞的。

source: It is intended to be compatible with the UDP API of the [http://w3.impa.br/~diego/software/luasocket/udp.html LuaSocket] library but is 100% nonblocking out of the box.
zh_cn: 它被设计为与 [http://w3.impa.br/~diego/software/luasocket/udp.html LuaSocket]库的 UDP API兼容，但是它天生是100%非阻塞的。

source: It is recommended however, to use the [[#ngx.req.read_body|ngx.req.read_body]] and [[#ngx.req.discard_body|ngx.req.discard_body]] functions for finer control over the request body reading process instead.
zh_cn: 推荐使用 [[#ngx.req.read_body|ngx.req.read_body]] 和 [[#ngx.req.discard_body|ngx.req.discard_body]] 函数来对请求体的读取过程进行精细控制。

source: It is recommended to always place the following piece of code at the end of Lua modules that use the I/O operations to prevent casual use of module-level global variables that are shared among ''all'' requests:
zh_cn: 建议总是在使用I/O操作的Lua模块的最后加上下面这段代码以防止随意使用由''所有''请求共享的模块级全局变量:

source: It is recommended to combine the <code>return</code> statement with this call, i.e., <code>return ngx.redirect(...)</code>, so as to be more explicit.
zh_cn: 建议将本方法与 <code>return</code> 一起使用, 即, <code>return ngx.redirect(...)</code>, 这样意义更明确.

source: It is recommended, though not necessary, to combine the <code>return</code> statement with this call, i.e., <code>return ngx.exit(...)</code>, to give a visual hint to others reading the code.
zh_cn: 我们建议，虽然不强制, 将<code>return</code> 语句与此方法一起使用, 如, <code>return ngx.exit(...)</code>, 为代码的阅读者以提示.

source: It is strongly recommended to combine the <code>return</code> statement with this call, i.e., <code>return ngx.exec(...)</code>.
zh_cn: 强烈建议将此函数与 <code>return</code> 一起使用, 即, <code>return ngx.exec(...)</code>.

source: It prevents undesirable race conditions while accessing such variables.
zh_cn: 这避免了访问这些变量时的不希望发生的竞争条件.

source: It returns a Lua string rather than a Lua table holding all the parsed query arguments.
zh_cn: 它返回装有所有解析过的请求参数的Lua字符串，而不是Lua table.

source: It returns the <code>1</code> in case of success and returns <code>nil</code> with a string describing the error otherwise.
zh_cn: 成功返回 <code>1</code> 失败返回 <code>nil</code> 和描述错误的字符串.

source: It should not be manually modified, renamed, or removed in Lua code.
zh_cn: 还要在Lua代码中对其进行修改，重命名或删除。

source: Its functionality will be implemented in future.
zh_cn: 其功能将来会实现.

source: J enable the PCRE Javascript compatible mode.
zh_cn: J 打开 PCRE Javascript兼容模式.

source: Just as [[#ngx.print|ngx.print]] but also emit a trailing newline.
zh_cn: 同 [[#ngx.print|ngx.print]] 但多发送一个尾部换行.

source: Just as any other rewrite phase handlers, [[#rewrite_by_lua|rewrite_by_lua]] also runs in subrequests.
zh_cn: 与其它的 rewrite phase handlers一样, [[#rewrite_by_lua|rewrite_by_lua]]也运行在 subrequests 中.

source: Just like [[#ngx.location.capture|ngx.location.capture]], but supports multiple subrequests running in parallel.
zh_cn: 同[[#ngx.location.capture|ngx.location.capture]], 但是支持并行的多个子请求.

source: Just like [[#ngx.re.sub|ngx.re.sub]], but does global substitution.
zh_cn: 类似 [[#ngx.re.sub|ngx.re.sub]], 但是做全局替换.

source: Just like the [[#ngx.shared.DICT.set|set]] method, but only stores the key-value pair into the dictionary [[#ngx.shared.DICT|ngx.shared.DICT]] if the key ''does'' exist.
zh_cn: 类似于 [[#ngx.shared.DICT.set|set]] , 但只有在字典[[#ngx.shared.DICTngx.shared.DICT]]中 ''不'' 存在键值的时候才将key-value对写入.

source: Just like the [[#ngx.shared.DICT.set|set]] method, but only stores the key-value pair into the dictionary [[#ngx.shared.DICT|ngx.shared.DICT]] if the key does ''not'' exist.
zh_cn: 类似于 [[#ngx.shared.DICT.set|set]] , 但只有当键值 ''不'' 存在时才将key-value对存入 [[#ngx.shared.DICT|ngx.shared.DICT]] .

source: Just to name a few:
zh_cn: 以下列出部分:

source: Just use a Lua table for the argument's value, for example:
zh_cn: 只需要用Lua table作为参数值, 例如:

source: Keys and values are unescaped according to URI escaping rules.
zh_cn: key和value都根据URI转义规则进行转义.

source: Keys and values will be unescaped according to URI escaping rules.
zh_cn: 键和值都根据URI转义规则进行转义.

source: Let us test it:
zh_cn: 我们来测试一下:

source: Library name <code>liblua.so</code> has been changed in liblua5.1 package, it only comes with <code>liblua5.1.so</code>, which needs to be symlinked to <code>/usr/lib</code> so it could be found during the configuration process.
zh_cn: liblua5.1包中的库名 <code>liblua.so</code> 改了，成了 <code>liblua5.1.so</code>, 需要以 <code>/usr/lib</code> 中添加符号链接使得在配置过程中能找到这个库.

source: Likewise, new "eof" flag can also be specified by setting a boolean value to [[#ngx.arg|ngx.arg]][2].
zh_cn: 类似的，也可以将[[#ngx.argngx.arg]][2]的值设为新的boolean值来修改 "eof" 标记。

source: Literal dollar sign characters (<code>$</code>) in the <code>replace</code> string argument can be escaped by another dollar sign, for instance,
zh_cn: <code>replace</code>中的美元符 (<code>$</code>)可以再用一个美元符进行转义，例如,

source: Loaded Lua modules persist in the nginx worker process level resulting in a small memory footprint in Lua even when under heavy loads.
zh_cn: 被加载的Lua模块保存在nginx worker进程一级，即使在高负载情况下也只有很小的内存开销。

source: Loading bytecode files via the Lua primitives like <code>require</code> and <code>dofile</code> should always work as expected.
zh_cn: 使用Lua内置的操作如 <code>require</code> 和 <code>dofile</code> 加载字节码文件应该总能工作.

source: Location jump will not be triggered otherwise, and only the current request's URI will be modified, which is also the default behavior.
zh_cn: 否则不会触发Location跳转, 而只是改变当前请求的 URI, 这也是默认的行为.

source: Log arguments concatenated to error.log with the given logging level.
zh_cn: 用指定的日志级别将参数添加到error.log

source: Logically speaking, the [[#ngx.location.capture|ngx.location.capture]] can be implemented like this
zh_cn: 从逻辑上说, [[#ngx.location.capture|ngx.location.capture]] 可以这样来实现

source: Lua <code>nil</code> arguments are accepted and result in literal <code>"nil"</code> string while Lua booleans result in literal <code>"true"</code> or <code>"false"</code> string outputs.
zh_cn: Lua <code>nil</code> 将输出 <code>"nil"</code> 字符串 Lua boolean值输出 <code>"true"</code> 或 <code>"false"</code> .

source: Lua <code>nil</code> arguments are accepted and result in literal <code>"nil"</code> strings while Lua booleans result in literal <code>"true"</code> or <code>"false"</code> strings.
zh_cn: 可接受Lua <code>nil</code> 参数，写入的值为 <code>"nil"</code> 字符串， 而Lua boolean值会被写入成 <code>"true"</code> 或 <code>"false"</code> 字符串.

source: Lua <code>nil</code> values will output <code>"nil"</code> strings and Lua boolean values will output <code>"true"</code> and <code>"false"</code> literal strings respectively.
zh_cn: Lua <code>nil</code> 值输出为 <code>"nil"</code> 字符串 ，Lua boolean 值分别输出为 <code>"true"</code> 和 <code>"false"</code> 字符串.

source: Lua tables can be used for both requests and responses when the number of subrequests to be issued is not known in advance:
zh_cn: 如果要发起的子请求的数量事先并不确定，可以在请求或响应中使用Lua table:

source: LuajIT can be downloaded from the [http://luajit.org/download.html the LuaJIT project website] and Lua 5.1, from the [http://www.lua.org/ Lua project website].
zh_cn: LuajIT 可以从 [http://luajit.org/download.html LuaJIT 官网]下载， Lua 5.1 从 [http://www.lua.org/ Lua官网]下载.

source: Matches the <code>subject</code> string using the Perl compatible regular expression <code>regex</code> with the optional <code>options</code>.
zh_cn: 使用Perl兼容的正则表达式<code>regex</code>和可选的<code>options</code>选项对<code>subject</code>字符串进行匹配.

source: More Nginx APIs for Lua may be supported in this context upon future user requests.
zh_cn: 如果将来有更多用户要求的话，会为这个上下文添加更多的Nginx API支持。

source: More often we just put it into a Lua loop:
zh_cn: 更多的时候我们只要将其放入一个Lua循环:

source: Multi-value arguments are also supported:
zh_cn: 也支持多值参数:

source: Multi-value headers can be set this way:
zh_cn: 多值头可以这样设置:

source: Multi-value query args are also supported.
zh_cn: 支持多值请求参数.

source: Multiple occurrences of an argument key will result in a table value holding all of the values for that key in order.
zh_cn: 如果一个参数的键出现多次，则生成一个包含有所有参数值的table，table中的元素次序与值出现的次序相同.

source: Multiple occurrences of an argument key will result in a table value holding all the values for that key in order.
zh_cn: 如果一个参数的key出现多次，则其value是一个按出现顺序保存多个值的table

source: Named captures are also supported since the <code>v0.7.14</code> release and are returned in the same Lua table as key-value pairs as the numbered captures.
zh_cn: 从<code>v0.7.14</code>版本开始，支持具名捕捉，捕捉的结果用同一个Lua table返回，以key-value的形式与基于下标的捕捉结果在一起。

source: Named locations are also supported, but query strings are ignored.
zh_cn: 支持具名location，但是query string将被忽略.

source: Named locations like <code>@foo</code> are not allowed due to a limitation in the nginx core.
zh_cn: 由于nginx内核的限制， 不允许有<code>@foo</code> 这样的具名location。

source: Near the boundary of the data stream, the data string actually returned could also be shorter than the size limit.
zh_cn: 而在接近数据流边界处, 实际返回的数据也可能比指定的大小小.

source: Nested arrays of strings are permitted and the elements in the arrays will be sent one by one:
zh_cn: 支持嵌套的字符串数组，数组中的元素将一个一个地发送:

source: Network I/O operations in user code should only be done through the Nginx Lua API calls as the Nginx event loop may be blocked and performance drop off dramatically otherwise.
zh_cn: 用户代码中的网络I/O操作只允许通过Nginx Lua API来进行，否则Nginx事件循环可能被阻塞，导致性能大降。

source: Nginx output filters may be called multiple times for a single request because response body may be delivered in chunks.
zh_cn: Nginx 输入过滤器对单个请求可能被调用多次，这是因为响应体可能是分段发送的

source: Nginx regex group capturing variables <code>$1</code>, <code>$2</code>, <code>$3</code>, and etc, can be read by this interface as well, by writing <code>ngx.var[1]</code>, <code>ngx.var[2]</code>, <code>ngx.var[3]</code>, and etc.
zh_cn: Nginx 正则表达式组捕捉变量 <code>$1</code>, <code>$2</code>, <code>$3</code>等也可以使用这一接口来读取, 写法是 <code>ngx.var[1]</code>, <code>ngx.var[2]</code>, <code>ngx.var[3]</code>, 等等.

source: Nginx variable interpolation is supported in the <code><path-to-lua-script-file></code> argument string of this directive.
zh_cn: 本命令的<code><path-to-lua-script-file></code>参数支持Nginx 变量 interpolation。

source: Nginx variables can be used in the <code><path-to-lua-script-file></code> string to provide flexibility.
zh_cn: 为了更灵活， <code><path-to-lua-script-file></code> 中允许使用Nginx变量.

source: Nginx's subrequests provide a powerful way to make non-blocking internal requests to other locations configured with disk file directory or ''any'' other nginx C modules like <code>ngx_proxy</code>, <code>ngx_fastcgi</code>, <code>ngx_memc</code>, <code>ngx_postgres</code>, <code>ngx_drizzle</code>, and even ngx_lua itself and etc etc etc.
zh_cn: Nginx子请求提供了向其它location发起非阻塞的内部请求的强大手段，这些location可以用磁盘文件路径或 ''任何'' 其它ngixn C 模块如 <code>ngx_proxy</code>, <code>ngx_fastcgi</code>, <code>ngx_memc</code>, <code>ngx_postgres</code>, <code>ngx_drizzle</code>, 甚至是ngx_lua自己等等来配置.

source: No end-of-line translation is performed; * <code>'*l'</code>: reads a line of text from the socket.
zh_cn: 不会执行行结束符转换; * <code>'*l'</code>: 从socket中按行读取文本.

source: Non-array table arguments will cause a Lua exception to be thrown.
zh_cn: 非数组table参数将抛出Lua异常.

source: None of the current request's subrequests will be affected.
zh_cn: 当前请求的任何子请求都不会受影响.

source: Note however that Lua global variables (note, not module-level variables) WILL NOT persist between requests because of the one-coroutine-per-request isolation design.
zh_cn: 注意，相反， Lua 全局变量 (注意，不是模块级别的变量) 将不会跨请求，这是由一个请求对应一个coroutine的设计理念决定的.

source: Note that <code>ngx.flush</code> is non functional when in the HTTP 1.0 output buffering mode.
zh_cn: 注意在HTTP 1.0 输出缓冲模式下 <code>ngx.flush</code> 无效.

source: Note that <code>ngx.header</code> is not a normal Lua table and as such, it is not possible to iterate through it using the Lua <code>ipairs</code> function.
zh_cn: 注意 <code>ngx.header</code> 不是一个正常的Lua table，所以不能使用<code>ipairs</code>函数来对它进行遍历.

source: Note that a longer from of the long bracket, <code>[=[...]=]</code>, may be required if the regex pattern contains <code>&#91;...]</code> sequences.
zh_cn: 注意当正则表达式包括<code>&#91;...]</code>序列时，可能需要更长的方括号形式<code>[=[...]=]</code>.

source: Note that a maximum of 100 request arguments are parsed by default (including those with the same name) and that additional request arguments are silently discarded to guard against potential denial of service attacks.
zh_cn: 注意，默认最多只解析100个请求参数 (包括名称一样的) ，多出来的请求参数将被简单丢弃，以防止DOS攻击.

source: Note that a maximum of 100 request headers are parsed by default (including those with the same name) and that additional request headers are silently discarded to guard against potential denial of service attacks.
zh_cn: 注意，默认最多只解析100个请求头 (包括名称一样的) ，多出来的请求头将被简单丢弃，以防止DOS攻击.

source: Note that calling this function instead of using <code>ngx.var.request_body</code> or <code>ngx.var.echo_request_body</code> is more efficient because it can save one dynamic memory allocation and one data copy.
zh_cn: 注意此方法比 <code>ngx.var.request_body</code> 或 <code>ngx.var.echo_request_body</code> 更高效，因为它可以节省一次动态内存分配和一次数据拷贝。

source: Note that common HTTP benchmark tools such as <code>ab</code> and <code>http_load</code> issue HTTP 1.0 requests by default.
zh_cn: 注意常用的HTTP benchmark工具如 <code>ab</code> 和 <code>http_load</code> 默认发送 HTTP 1.0 请求.

source: Note that if both <code>share_all_vars</code> and <code>copy_all_vars</code> are set to true, then <code>share_all_vars</code> takes precedence.
zh_cn: 注意，如果 <code>share_all_vars</code> 和 <code>copy_all_vars</code> 都设为true, <code>share_all_vars</code> 优先.

source: Note that it is not possible to use this interface to rewrite URI arguments and that [[#ngx.req.set_uri_args|ngx.req.set_uri_args]] should be used for this instead.
zh_cn: 注意不能使用这个接口来重写URI参数，请使用 [[#ngx.req.set_uri_args|ngx.req.set_uri_args]].

source: Note that it is recommended to use LuaJIT 2.0 instead of the standard Lua 5.1 interpreter where possible.
zh_cn: 注意，推荐尽可能使用 LuaJIT 2.0 而不是标准 Lua 5.1 解释器.

source: Note that only already defined nginx variables can be written to.
zh_cn: 注意只有已经定义了的nginx变量可以被写入.

source: Note that only three of these constants are utilized by the [[#Nginx API for Lua|Nginx API for Lua]] (i.e., [[#ngx.exit|ngx.exit]] accepts <code>NGX_OK</code>, <code>NGX_ERROR</code>, and <code>NGX_DECLINED</code> as input).
zh_cn: 注意这些常量中只有三个能被 [[#Nginx API for Lua|可供Lua调用的Nginx API]]使用 ([[#ngx.exit|ngx.exit]] 接受 <code>NGX_OK</code>, <code>NGX_ERROR</code>, and <code>NGX_DECLINED</code> 作为输入).

source: Note that subrequests issued by [[#ngx.location.capture|ngx.location.capture]] inherit all the request headers of the current request by default and that this may have unexpected side effects on the subrequest responses.
zh_cn: 注意在默认情况下 [[#ngx.location.capture|ngx.location.capture]] 发起的子请求将从当前请求中继承所有的请求头，这可能会对子请求的响应带来意料之外的副作用。

source: Note that the [[#ngx.var.VARIABLE|ngx.var.HEADER]] API call, which uses core [[HttpCoreModule#$http_HEADER|$http_HEADER]] variables, may be more preferable for reading individual request headers.
zh_cn: 注意，使用内核模块[[HttpCoreModule#$http_HEADER$http_HEADER]]的 [[#ngx.var.VARIABLE|ngx.var.HEADER]] API, 可能更适合用来读取某一个头信息。

source: Note that the [http://mdounin.ru/hg/ngx_http_auth_request_module/ ngx_auth_request] module can be approximated by using [[#access_by_lua|access_by_lua]]:
zh_cn: 注意 [http://mdounin.ru/hg/ngx_http_auth_request_module/ ngx_auth_request] 模块可以用 [[#access_by_luaaccess_by_lua]]来实现.

source: Note that the [http://www.grid.net.ru/nginx/eval.en.html ngx_eval] module can be approximated by using [[#rewrite_by_lua|rewrite_by_lua]].
zh_cn: 注意 [http://www.grid.net.ru/nginx/eval.en.html ngx_eval] 模块可以用 [[#rewrite_by_lua|rewrite_by_lua]]来实现.

source: Note that the cosocket connection pool is per Nginx worker process rather than per Nginx server instance, so the size limit specified here also applies to every single Nginx worker process.
zh_cn: 注意cosocket连接池是每个nginx worker进程所有的而不是整个nginx服务器进程所有，所以这里所设置的上限也适用于每个单独的nginx worker 进程.

source: Note that the cosocket connection pool is per nginx worker process rather than per nginx server instance, so size limit specified here also applies to every single nginx worker process.
zh_cn: 注意cosocket连接池是每个nginx worker进程所有的而不是整个nginx服务器进程所有，所以这里所设置的上限也适用于每个单独的nginx worker 进程.

source: Note that the following API functions are currently disabled within this context:
zh_cn: 注意在这个上下文中以下 API 函数是被禁止的:

source: Note that the size of the connection pool cannot be changed once the pool is created.
zh_cn: 注意当连接池一旦被创建，将不能改变其大小。

source: Note that the value of an expired key is not guaranteed to be available so one should never rely on the availability of expired items.
zh_cn: 注意已过期的键的值并不能保证可用，所以不能依赖于过期项的可用性。.

source: Note that there is no need to call this method on socket objects that have invoked the [[#tcpsock:setkeepalive|setkeepalive]] method because the socket object is already closed (and the current connection is saved into the built-in connection pool).
zh_cn: 注意不需要对调用过[[#tcpsock:setkeepalivesetkeepalive]]方法的socket对象调用此方法，因为socket对象已经关闭了 (相应的连接被保存进内置的连接池).

source: Note that there is normally no need to manually send out response headers as ngx_lua will automatically send headers out before content is output with [[#ngx.say|ngx.say]] or [[#ngx.print|ngx.print]] or when [[#content_by_lua|content_by_lua]] exits normally.
zh_cn: 注意通常并不需要手动发送响应头，因为在[[#ngx.sayngx.say]] 或 [[#ngx.printngx.print]]之前或[[#content_by_luacontent_by_lua]]显式地退出时ngx_lua将自动地发送响应头.

source: Note that this data sharing is on a ''per-worker'' basis and not on a ''per-server'' basis.
zh_cn: 注意这种数据共享是 ''worker''级别 而不是 ''server''级别 的.

source: Note that this handler always runs ''after'' the standard [[HttpAccessModule]].
zh_cn: 注意这个handler总是在标准 [[HttpAccessModule]] ''之后''执行 .

source: Note that this handler always runs ''after'' the standard [[HttpRewriteModule]].
zh_cn: 注意这个handler总是在标准 [[HttpRewriteModule]] ''之后''执行 .

source: Note that this is very different from [[#ngx.redirect|ngx.redirect]] in that it is just an internal redirect and no new HTTP traffic is involved.
zh_cn: 注意，这跟 [[#ngx.redirect|ngx.redirect]] 是完全不同的，它只是一个内部重定向，并没有新的HTTP流量产生.

source: Note that this method does ''not'' affect the [[#lua_socket_keepalive_timeout|lua_socket_keepalive_timeout]] setting; the <code>timeout</code> argument to the [[#tcpsock:setkeepalive|setkeepalive]] method should be used for this purpose instead.
zh_cn: 注意本方法 ''不会'' 影响 [[#lua_socket_keepalive_timeout|lua_socket_keepalive_timeout]] 设置; 必须通过 [[#tcpsock:setkeepalivesetkeepalive]]的<code>timeout</code> 参数来达到这个目的。

source: Note that using the Lua coroutine mechanism means that this function does not block the Nginx event loop even in the synchronous mode.
zh_cn: 注意使用Lua coroutine机制意味着此函数即使在同步模式下也不会阻塞 Nginx 事件循环.

source: Note that when calling <code>ngx.exit(ngx.OK)</code> within a [[#access_by_lua|access_by_lua]] handler, the nginx request processing control flow will still continue to the content handler.
zh_cn: 注意在 [[#access_by_luaaccess_by_lua]] handler中调用<code>ngx.exit(ngx.OK)</code>时, nginx请求处理控制流仍然会继续执行 content handler.

source: Note that when calling <code>ngx.exit(ngx.OK)</code> within a [[#rewrite_by_lua|rewrite_by_lua]] handler, the nginx request processing control flow will still continue to the content handler.
zh_cn: 注意在 [[#rewrite_by_lua|rewrite_by_lua]] handler中调用<code>ngx.exit(ngx.OK)</code>时, nginx请求处理控制流仍然会继续执行 content handler.

source: Note that while this method accepts all [[#HTTP status constants|HTTP status constants]] as input, it only accepts <code>NGX_OK</code> and <code>NGX_ERROR</code> of the [[#core constants|core constants]].
zh_cn: 注意，虽然这个方法接受所有的 [[#HTTP status constants|HTTP状态常量]]作为输入, 但是在[[#core constantscore constants]]中仅支持 <code>NGX_OK</code> 和 <code>NGX_ERROR</code>。

source: Note that, LRU takes priority over expiration time here.
zh_cn: 注意，在这里LRU比过期时间优先级高。

source: Note that, the <code>options</code> argument is not optional when the <code>ctx</code> argument is specified and that the empty Lua string (<code>""</code>) must be used as placeholder for <code>options</code> if no meaningful regex options are required.
zh_cn: 注意，如果指定了<code>ctx</code>参数， <code>options</code> 参数就是必选的，即使不需要有意义的正则选项，也要提供空的Lua字符串 (<code>""</code>).

source: Note that, the actual data returned ''might'' be a little longer than the size limit specified by the <code>size</code> argument when the boundary pattern has ambiguity for streaming parsing.
zh_cn: 注意，如果用来做流解析的边界模式有歧义，实际返回的数据 ''可能'' 会比<code>size</code>参数指定的长度略长.

source: Number literals can be used directly as the argument, for instance,
zh_cn: 可以直接用数字作为参数，例如，

source: On FreeBSD, you can only tune the system-wide configuration for TCP keepalive, for example:
zh_cn: 在 FreeBSD 上, 你只能在系统级别配置 TCP keepalive, 如:
